graph-diagram.mmd
graph TD
  source[input]
  process1[process]
  process2[process]
  final[output]
  source --> process1
  process1 --> process2
  process2 --> final
